const langAuto = {
  stydy_life: {
    EN: 'Student Life',
    TH: 'ชีวิตสมัยเรียน',
    JP: 'がくせいじだい',
    CN: '学生时代'
  }
}

const AutoBiography = () => {
  const { lang, currentLanguage: l } = useContext(Context)
  return <div className="py-4">
    <style>{`

    ` + mobileCSS(`
      .ifr1 {
        
      }
    `) + desktopCSS(`
      .ifr1 {

      }
    `)}</style>

    <article className="px-4">
      <p className="text-2xl">ประวัติการย้ายที่อยู่อาศัยของผม</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. ตอนเกิดอยู่บ้านยายที่ซอยโปโล จนถึงอนุบาล 2</li>
        <li>2. ป.1 เทอม 1 พ่อกับแม่ ย้ายไปอยู่บ้านเช่าไม่ไกล จากบ้านยายมากนัก</li>
        <li>3. ป.1 เทอม 2 ย้ายไปอยู่แฟลตข้าราชการ ที่บางแค </li>
        <li>4. ป.5 ช่วงปิดเทอม ย้ายไปอยู่บ้านป้าแอ๋ะ (พี่สาวพ่อ) ที่จันทบุรี </li>
        <li>5. ป.6 ย้ายไปอยู่บ้านย่า จนถึงจบ ม.3 </li>
        <li>6. ม.4 ย้ายกลับมาอยู่บ้านยาย ที่ซอยโปโล และอยู่มาจนถึงปัจจุบัน </li>
      </ul>
      
    </article>

    <br />
    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl">ญาติที่เคยอยู่ด้วยกัน เรียงลำดับตามความรักและผูกผันจากมากที่สุดไปน้อยที่สุด ชีวิตของผมมีญาติที่ดีด้วยมากๆไม่กี่คน</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. พ่อตุ้ม อยู่กับผมตั้งแต่เกิดจนถึง ป.4 เทอม 1</li>
        <li>2. ตานัน อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึง ปัจจุบัน</li>
        <li>3. ย่า อยู่กับผม ช่วง ป.6 เป็นญาติที่อยู่กับผมสั้นมาก แต่ความทรงจำที่มีสวยงาม</li>
        <li>4. ลุงหมา กับพี่ทราย อยู่กับผมตั้งแต่ ป.6 จนถึงจบ ม.3</li>
        <li>5. ไอ้ตูมตาม เป็นหมาที่ผมรักมาก อยู่กับผมตั้งแต่ ป.6 จนถึง มัธยม</li>
        <li>6. ยายผอม อยู่กับผมตั้งแต่เกิด จนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึงมหาลัยปี 2</li>
        <li>7. ป้าเจ อยู่กับผมตั้งแต่ ป.2 จนถึง ป.5 </li>
        <li>8. ลุงแมว พี่เอ็ม ป้าแอ๋ะ ลุงปื๊ด ป้าตู่ ป้าเล็ก(ฝั่งพ่อ) น้องเป้ น้องกร</li>
        <li>9. แม่ตุ๊ก อยู่กับผมตั้งแต่เกิดจนถึง ป.1 เทอม 2 ผมเอาแม่ไว้ข้อนี้ เพราะแม่ไม่ได้มีบทบาทอะไรกับชีวิตผมมากนัก นอกจากทำให้เกิดมาและทิ้งผมไป</li>
        <li>10. ป้าเล็ก(ฝั่งแม่) ญาติเพียงคนเดียวในโลก ที่ผมใช้คำว่า "เกลียด" อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 และกลับมาอยู่ด้วยช่วงมหาลัย จนถึง ปัจจุบัน</li> 
      </ul>
      <p className="indent-6 text-sm">นี่คือรายชื่อญาติที่ผมเคยอยู่ด้วย ปัจจุบันนี้อยู่แค่กับตานัน และป้าเล็กที่บ้านยายที่ซอยโปโล ส่วนญาติที่เหลือไม่ได้อยู่ด้วยกันเกิน 10 ปีแล้ว</p>
    </article>

    <br />
    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl">ปมชีวิต</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. พ่อกับแม่ หย่ากัน ตอน ป.1 เทอม 2 แม่มีครอบครัวใหม่ ส่วนพ่อมีแฟนใหม่ คือ ป้าเจ ผมอยู่กับพ่อและแฟนใหม่พ่อ จนกระทั่ง พ่อเสียตอน ป.4 เทอม 1</li>
        <li>2. ตอน ป.4 เทอม 2 หลังงานศพพ่อ ป้าเจเคยทิ้งผมไว้ให้อยู่คนเดียว 1 อาทิตย์ กับเงิน 10 บาท และ ไวไว 1 แพค ไม่ได้บอกผมล่วงหน้าด้วยว่าจะกลับวันไหน ทิ้งไปดื้อๆ ผมคิดฆ่าตัวตายครั้งแรกในชีวิตคือตอนนั้น ผมไม่มีเงินกินข้าว ไปยืนจ้องไก่ย่างร้านส้มตำ จนแม่ค้าเขายอมให้ เพราะพ่อสอนว่าห้ามขโมย
          ถ้าตอนนั้น ป้าเจ ไม่กลับมา ผมน่าจะฆ่าตัวตายไปแล้ว ผมนอน เอามีดไว้ข้างตัวทุกคืน แต่ไม่ได้ฆ่าตัวตายเพราะกลัวเจ็บ
        </li>
        <li>3. ผมเคยได้เงินมากสุดในชีวิต คือ 10000 บาท เพียง 1 ครั้งในชีวิต คือขอยายซื้อ โน๊ตบุ๊ค เอาไว้ทำงาน+เขียน code สมัยเรียน มหาลัย ซึ่ง ตอน ปี 1 ผมอาศัยยืมของเพื่อน ซึ่งต้องขอหลายครั้งกว่ายายจะยอมให้</li>
        <li>4. ผมไม่ได้ขอเงินยาย ตั้งแต่ขึ้น ปี 3 เพราะยายพูดจาไม่ดีมาตลอด + ป้าเล็กบอกว่าผมเรียนไม่จบหรอก ผมโมโห เลยเลิกพึ่งพาพวกเขา และเรียนจนจบ</li>
        <li>5. ช่วงที่ยังเรียนไม่จบแล้วไม่ได้ขอเงินยายแล้ว มีบางช่วงที่ เงินฝึกงานได้ช้า ผมต้องเดินไป-กลับจากบ้าน ไปรัชดา ไม่มีค่ารถ ไม่มีค่าข้าว อยู่เป็นหลายวัน ทำอะไรไม่ได้นอกจากอดทน เดินออกจากบ้านตี 3 เดินกลับบ้าน 2 ทุ่ม</li>
        <li>6. ไม่มีญาติคนไหนเลย มางานรับปริญญาของผม จนผมต้องให้แม่มา เพราะไม่มีใครมาเลย แม้แต่ยาย ทั้งๆที่แม่ไม่ได้ส่งเสียอะไรผมเลย</li>
        <li>7. ผมไม่มีความทรงจำ เลือกซื้อเสื้อผ้า กับครอบครัว ผมโตมากับเสื้อผ้า ที่เป็นของใครไม่รู้ แม้แต่หลังเรียนจบ ทำงานบริษัท ไม่มีแม้กระทั่งเสื้อผ้าไปทำงานเดือนแรก ต้องรอเงินเดือนออก เพื่อซื้อเสื้อเชิ๊ต</li>
        <li>8. ตั้งแต่ขึ้นมหาลัย จนเรียนจบทำงาน ในแต่ละปี ผมกินข้าวกับเพื่อนสมัยเรียน หรือเพื่อนร่วมงาน มากกว่าครอบครัว</li>
        <li>9. ผมไม่มีความทรงจำ กินข้าวนอกบ้านกับครอบครัว ที่นึกออกมีแค่พายายไปเลี้ยงข้าวที่ห้าง 1 ครั้ง หลังจากพายายไปทำธุระ กับญาติพาไปกินข้าวที่ทะเล ที่ลอยอังคารพ่อ เมื่อหลาย 10 ปีก่อน ตอนเด็ก 1 ครั้ง</li>
        <li>10. ผมนึกไม่ออกว่าเคยไปเที่ยวกับครอบครัว และยิ้มอย่างมีความสุข ครั้งแรกและล่าสุดคือที่ไหน นึกไม่ออก น่าจะเป็นตอนพ่อพาไปงานวันเด็กที่ กองทัพอากาศสมัยประถม</li>
        <li>11. ผมไม่เคยได้เค้กวันเกิด หรือของขวัญวันเกิดจากครอบครัว</li>
        <li>12. ผมไม่เคยจับมือผู้หญิง ตลอด 30 ปีที่ผ่านมา และอาจจะตายจากโลกนี้ไปโดยไม่ได้จับมือผู้หญิง</li>
        <li>13. ผมเกิดมาไม่เคยไปร่วมงานแต่งงานใครเลย ไม่มีประสบการณ์</li>
      </ul>
      
    </article>

    <br />
    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <div className="fb_wrapper" style={{ display: "flex", flexDirection: "row", gap: '6px', justifyContent: 'center', flexWrap: 'wrap', width: '100%', minHeight: '100vh' }}>
      <div style={{ width: '324px', height: `${isFBApp ? '623px' : '553px'}` }}>
        <span className="text-xl">2010-2015</span>
        <a href="https://www.facebook.com/tor.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D692949137434104%26set%3Da.255540504508305&show_text=false&width=324"
            width="324" height={`${isFBApp ? '623px' : '553px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      <div style={{ width: '324px', height: `${isFBApp ? '490px' : '440px'}` }}>
        <span className="text-xl">2016-2017</span>
        <a href="https://www.facebook.com/torn.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D378241239184959%26set%3Da.131442370531515&show_text=false&width=324"
            width="324" height={`${isFBApp ? '490px' : '440px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      <div style={{ width: '324px', height: `${isFBApp ? '403px' : '373px'}` }}>
        <span className="text-xl">2017-2023</span>
        <a href="https://www.facebook.com/tron.json" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D1359321627882023%26set%3Da.104674606680071&show_text=false&width=324"
            width="324" height={`${isFBApp ? '403px' : '373px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
    </div>
    <br />< br /><br />< br />
  </div>
}
