const langAuto = {
  stydy_life: {
    EN: 'Student Life',
    TH: 'ชีวิตสมัยเรียน',
    JP: 'がくせいじだい',
    CN: '学生时代'
  }
}

const AutoBiography = () => {
  const { lang, currentLanguage: l } = useContext(Context)
  return <div className="py-4">
    <style>{`

    ` + mobileCSS(`
      .ifr1 {
        
      }
    `) + desktopCSS(`
      .ifr1 {

      }
    `)}</style>

    <div className="fb_wrapper" style={{ display: "flex", flexDirection: "row", gap: '6px', justifyContent: 'center', flexWrap: 'wrap', width: '100%', minHeight: `${isFBApp ? '580px' : '520px'}` }}>
      <div style={{ width: '324px', height: `${isFBApp ? '580px' : '520px'}` }}>
        <span className="text-lg">FB 2010-2015 (ชีวิตวัยเรียน)</span>
        <a href="https://www.facebook.com/tor.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D692949137434104%26set%3Da.255540504508305&show_text=false&width=324"
            width="324" height={`${isFBApp ? '580px' : '520px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      <div style={{ width: '324px', height: `${isFBApp ? '510px' : '450px'}` }}>
        <span className="text-lg">FB 2016-2017 (ชีวิตทำงานปีแรกหลังเรียนจบ)</span>
        <a href="https://www.facebook.com/torn.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D378241239184959%26set%3Da.131442370531515&show_text=false&width=324"
            width="324" height={`${isFBApp ? '510px' : '450px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      <div style={{ width: '324px', height: `${isFBApp ? '403px' : '373px'}` }}>
        <span className="text-lg">FB 2017-2023 (ชีวิตการทำงานก่อนอายุ 30)</span>
        <a href="https://www.facebook.com/tron.json" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D1359321627882023%26set%3Da.104674606680071&show_text=false&width=324"
            width="324" height={`${isFBApp ? '403px' : '373px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
    </div>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4 py-4 sm:py-0">
      <p className="text-2xl"># ประวัติการย้ายโรงเรียน</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. กิตติมาศเนอร์สเซอรี่ อนุบาล 1 - อนุบาล 2 </li>
        <li>2. โรงเรียนวรรณวิทย์ ป.1 เทอม 1 </li>
        <li>3. โรงเรียนวัดอ่างแก้ว (จีบ ปานขำ) ป.1 เทอม 2 </li>
        <li>4. โรงเรียนวัดนิมมานรดี ป.2 - ป.5 </li>
        <li>5. โรงเรียนวัดคมบาง (เพิ่มพิทยากร) ป.6 </li>
        <li>6. โรงเรียนเบญจมราชูทิศ จันทบุรี ม.1 - ม.3</li>
        <li>7. โรงเรียนไตรมิตรวิทยาลัย ม.4 - ม.6 </li>
        <li>8. สถาบันการจัดการปัญญาภิวัฒน์ ปริญญาตรี</li>
      </ul>

    </article>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl"># ประวัติการย้ายที่อยู่อาศัย</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. ตอนเกิดอยู่บ้านยายที่ซอยโปโล จนถึงอนุบาล 2</li>
        <li>2. ป.1 เทอม 1 พ่อกับแม่ ย้ายไปอยู่บ้านเช่าไม่ไกล จากบ้านยาย</li>
        <li>3. ป.1 เทอม 2 ย้ายไปอยู่แฟลตข้าราชการ ที่บางแค </li>
        <li>4. ป.5 ช่วงปิดเทอม ย้ายไปอยู่บ้านป้าแอ๋ะ (พี่สาวพ่อ) ที่จันทบุรี </li>
        <li>5. ป.6 ย้ายไปอยู่บ้านย่า จนถึงจบ ม.3 </li>
        <li>6. ม.4 ย้ายกลับมาอยู่บ้านยาย ที่ซอยโปโล และอยู่มาจนถึงปัจจุบัน </li>
      </ul>

    </article>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl"># ญาติที่เคยอยู่ด้วยกัน เรียงลำดับตามความรักและผูกผันจากมากที่สุดไปน้อยที่สุด</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. พ่อตุ้ม อยู่กับผมตั้งแต่เกิดจนถึง ป.4 เทอม 1</li>
        <li>2. ตานัน อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึง ปัจจุบัน</li>
        <li>3. ย่า อยู่กับผม ช่วง ป.6 เป็นญาติที่อยู่กับผมสั้นมาก แต่ความทรงจำที่มีสวยงาม</li>
        <li>4. ลุงหมา กับพี่ทราย อยู่กับผมตั้งแต่ ป.6 จนถึงจบ ม.3</li>
        <li>5. ไอ้ตูมตาม เป็นหมาที่ผมรักมาก อยู่กับผมตั้งแต่ ป.6 จนถึง มัธยม</li>
        <li>6. ยายผอม อยู่กับผมตั้งแต่เกิด จนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึงมหาลัยปี 2</li>
        <li>7. ป้าเจ (แฟนใหม่พ่อ) อยู่กับผมตั้งแต่ ป.2 จนถึง ป.5 </li>
        <li>8. ญาติฝั่งพ่อคนอื่นๆ - ลุงแมว พี่เอ็ม ป้าแอ๋ะ ลุงปื๊ด ป้าตู่ ป้าเล็ก(ฝั่งพ่อ) น้องเป้ น้องกร</li>
        <li>9. ญาติฝั่งแม่คนอื่นๆ - ป้าอ้วน พี่ตั๊ก พี่ดี้ ไอดอน</li>
        <li>10. แม่ตุ๊ก อยู่กับผมตั้งแต่เกิดจนถึง ป.1 เทอม 2 ผมเอาแม่ไว้ข้อนี้ เพราะแม่ไม่ได้มีบทบาทอะไรกับชีวิตผมมากนัก นอกจากทำให้เกิดมาและทิ้งผมไป</li>
        <li>11. ป้าเล็ก(ฝั่งแม่) ญาติเพียงคนเดียวในโลก ที่ผมใช้คำว่า "เกลียด" อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 และกลับมาอยู่ด้วยช่วงมหาลัย จนถึง ปัจจุบัน</li>
      </ul>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">นี่คือรายชื่อญาติที่ผมเคยอยู่ด้วย ปัจจุบันนี้อยู่แค่กับตานัน และป้าเล็กที่บ้านยายที่ซอยโปโล ส่วนญาติที่เหลือไม่ได้อยู่ด้วยกันเกิน 10 ปีแล้ว</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>

    <article className="px-4">
      <p className="text-2xl"># ปมชีวิต</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">ผมไม่อยากให้ตัวเองลืม "ปมชีวิต" เหล่านี้ หรือปล่อยให้หายไปตามกาลเวลา เมื่อผมเริ่มอายุมากขึ้น เลยเอามาพิมพ์ไว้ในนี้</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <ul className="indent-6 py-2 text-sm">
        <li>1. แม่พาไปขโมยของในห้าง ตอนอนุบาล โดนเจ้าหน้าที่ห้างจับได้ จนพ่อต้องมาช่วย </li>
        <li>2. พ่อกับแม่ หย่ากัน ตอน ป.1 เทอม 2 แม่มีครอบครัวใหม่ ส่วนพ่อมีแฟนใหม่ คือ ป้าเจ ผมอยู่กับพ่อและแฟนใหม่พ่อ จนกระทั่ง พ่อเสียตอน ป.4 เทอม 1</li>
        <li>3. ตอนงานศพพ่อ แม่บอกญาติๆ ว่าเลี้ยงผมไม่ไหว ตอนนั้น ผมไม่ได้โกรธอะไรแม่ คิดแค่ว่า แม่มีครอบครัวใหม่ไปแล้ว เดี๋ยวผมอยู่กับญาติๆแทนก็ได้</li>
        <li>4. ตอน ป.4 เทอม 2 หลังงานศพพ่อ ป้าเจเคยทิ้งผมไว้ให้อยู่คนเดียว 1 อาทิตย์ กับเงิน 10 บาท และ ไวไว 1 แพค ไม่ได้บอกผมล่วงหน้าด้วยว่าจะกลับวันไหน ทิ้งไปดื้อๆ ผมคิดฆ่าตัวตายครั้งแรกในชีวิตคือตอนนั้น ผมไม่มีเงินกินข้าว ไปยืนจ้องไก่ย่างร้านส้มตำ จนแม่ค้าเขายอมให้ เพราะพ่อสอนว่าห้ามขโมย
          ถ้าตอนนั้น ป้าเจ ไม่กลับมา ผมน่าจะฆ่าตัวตายไปแล้ว ผมนอน เอามีดไว้ข้างตัวทุกคืน แต่ไม่ได้ฆ่าตัวตายเพราะกลัวเจ็บ
        </li>
        <li>5. ตอนที่ผมอยู่จันทบุรี ยายผมเขาได้กำชับ ญาติๆที่จันทบุรี ทางโทรศัพท์ว่า ห้ามให้ผมขี่ มอเตอร์ไซด์ ลุงเลยไม่ได้สอนและอนุญาติให้ผมขี่ ทั้งๆที่บ้านผมอยู่ในป่า ผมต้องเดินเท้าออกมาไกลมาก หมาก็ดุ เขาไม่ให้ผมขี่เพียงเพราะ ญาติเพื่อนเขาที่กรุงเทพ ประสบอุบัติเหตุ แต่เขาไม่ได้มองถึงชีวิตความเป็นอยู่ผมเลย</li>
        <li>6. ผมย้ายมาเรียนกรุงเทพ ตอน ม.4 เพราะคิดว่าย้ายมาอยู่กับยาย แล้วจะสบายขึ้น แต่จริงๆ คือลำบากกว่าเดิม มากๆ ผมขอเงินยายเอาไปปักตราโรงเรียนที่ร้าน สิ่งที่ยายให้ผมไม่ใช่เงินแต่เป็น ชุน กับ ด้าย
          ผมต้องอดหลับอดนอน เอา ชุน กับ ด้าย ปักตราโรงเรียนเอง ผลปรากฏว่า ตอนเข้าแถวที่โรงเรียน ครูดุผม แล้วสั่งให้ผมรื้อ ตอนนั้น ผมไม่ได้โกรธอะไรยาย แต่โกรธครูที่ไม่เข้าใจ ฐานะทางบ้านของผม
          (ถ้าผมอยู่กับญาติที่จันทบุรีต่อ ยังไง ลุงหมา ก็ให้เงิน ไปปักที่ร้าน ผมเริ่มรู้สึกว่าโดนยายหลอกมาอยู่ด้วยที่กรุงเทพ ตั้งแต่เหตุการณ์ครั้งนั้น)
        </li>
        <li>7. ช่วง ม.4 ผมตั้งใจเรียน จนได้ที่ 1 ของ สาย ศิลป์-คำนวณ แต่ไม่มีใครชมอะไรผมเลย เสาร์ อาทิตย์ผมอยู่บ้าน อ่านหนังสือ ปัดกวาดบ้าน ทำงานบ้าน ก็เอาแต่บ่นว่า ผมอยู่แต่บ้าน</li>
        <li>8. ผมอ่านหนังสือเรียน อ่านหนังสือสอบ จนดึกดื่น ก็บ่นว่า ไม่รู้จักหลับจักนอน เสาร์-อาทิตย์ นอนตื่นสาย ก็เอาไม้กระทุ้งพื้นห้องผม ให้ผมตื่น </li>
        <li>9. ผมโตมากับการยืมเงินเพื่อนๆ และยืมของเพื่อน เพราะทางบ้านมักไม่ค่อยเข้าใจ อย่างเช่น ต้องซื้อกระดาษ ซื้ออุปกรณ์เครื่องเขียน หรือแม้แต่ไป ทัศนศึกษาผมก็ไม่มีเงินพิเศษ อะไร บางวันก็ไม่ได้ค่าขนมไปเรียน ก็ต้องยืมเพื่อน </li>
        <li>10. ตอน จบ ม.6 ไม่มีใครสนับสนุนให้ผมเรียนต่อมหาลัย ผมสอบได้ทุน จึงมีโอกาสได้เรียน (ผมเพิ่งมาได้ยิน และรู้จักคำว่า กยศ. ภายหลัง ตอนนั้น ยังกลัวการเป็นหนี้เยอะๆ เพราะไม่มีใครส่งเสีย)</li>
        <li>11. ผมเคยได้เงินมากสุดในชีวิต คือ 10000 บาท เพียง 1 ครั้งในชีวิต คือขอยายซื้อ โน๊ตบุ๊ค เอาไว้ทำงาน+เขียน code สมัยเรียน มหาลัย ซึ่ง ตอน ปี 1 ผมอาศัยยืมของเพื่อน ซึ่งต้องขอหลายครั้งกว่ายายจะยอมให้</li>
        <li>12. ผมต้องอาศัย นอนบ้านเพื่อน และ หอเพื่อน แถวมหาลัย เพื่อประหยัดค่าเดินทาง ในการไปเรียน</li>
        <li>13. ผมไม่ได้ขอเงินยาย ตั้งแต่ขึ้น ปี 3 เพราะยายพูดจาไม่ดีมาตลอด + ป้าเล็กบอกว่าผมเรียนไม่จบหรอก ผมโมโห เลยเลิกพึ่งพาพวกเขา และเรียนจนจบ</li>
        <li>14. ช่วงที่ยังเรียนไม่จบแล้วไม่ได้ขอเงินยายแล้ว มีบางช่วงที่ เงินฝึกงานได้ช้า ผมต้องเดินไป-กลับจากบ้าน ไปรัชดา ไม่มีค่ารถ ไม่มีค่าข้าว อยู่เป็นหลายวัน ทำอะไรไม่ได้นอกจากอดทน เดินออกจากบ้านตี 3 เดินกลับบ้าน 2 ทุ่ม</li>
        <li>15. ไม่มีญาติคนไหนเลย มางานรับปริญญาของผม จนผมต้องให้แม่มา เพราะไม่มีใครมาเลย แม้แต่ยาย ทั้งๆที่แม่ไม่ได้ส่งเสียอะไรผมเลย</li>
        <li>16. ตอนเงินเดือนออก เดือนแรก ผมให้เงินแม่ ตอบแทนที่มางานรับปริญญาผม แต่ตลอดหลายปีที่ผ่านมา แม่ทักแชทมามีแต่ยืมเงิน ไม่มีเรื่องอื่น นอกจากยืมเงิน ถ้ามีผมก็โอนให้ตลอด แต่แม่ไม่เคยถามสารทุกข์ สุขดิบ อะไรผมเลย ในแชทมีแต่เรื่องยืมเงินอย่างเดียว ของเก่าไม่คืน ยังทักมายืมของใหม่ด้วยซ้ำ</li>

        <li>17. ผมไม่มีความทรงจำ เลือกซื้อเสื้อผ้า กับครอบครัว ผมโตมากับเสื้อผ้า ที่เป็นของใครไม่รู้ แม้แต่หลังเรียนจบ ทำงานบริษัทเดือนแรก ไม่มีแม้กระทั่งเสื้อผ้าไปทำงาน ต้องรอเงินเดือนออก เพื่อซื้อเสื้อเชิ๊ต ตอนทำงานเดือนแรก ก็ต้องเดิน ไป-กลับ จากบ้าน ไปอโศก ไม่มีค่ารถ ไม่มีค่าข้าว</li>
        <li>18. ตั้งแต่ขึ้นมหาลัย จนเรียนจบทำงาน ในแต่ละปี ผมกินข้าวกับเพื่อนสมัยเรียน หรือเพื่อนร่วมงาน มากกว่าครอบครัว</li>
        <li>19. ผมไม่มีความทรงจำ กินข้าวนอกบ้านกับครอบครัว ที่นึกออกมีแค่พายายไปเลี้ยงข้าวที่ห้าง 1 ครั้ง หลังจากพายายไปทำธุระ กับญาติพาไปกินข้าวที่ทะเล ที่ลอยอังคารพ่อ เมื่อหลาย 10 ปีก่อน ตอนเด็ก 1 ครั้ง</li>
        <li>20. ผมไม่ได้กินข้าวบ้าน ตั้งแต่มีรายได้ ก่อนเรียนจบก็นานๆกินที ไม่ได้กินทุกวัน</li>
        <li>21. ผมนึกไม่ออกว่าเคยไปเที่ยวกับครอบครัว และยิ้มอย่างมีความสุข ครั้งแรกและล่าสุดคือที่ไหน น่าจะเป็นตอนพ่อพาไปงานวันเด็กที่ กองทัพอากาศสมัยประถม</li>
        <li>22. ชีวิตผม ย้ายบ้าน ย้ายโรงเรียน มาหลายครั้ง อยู่กับญาติมาหลายคน ผมไม่เคยขออะไรพวกเขาเลย เสื้อผ้า ขนม หรือสิ่งที่อยากกิน นอกจากสิ่งที่จำเป็นกับการเรียนแค่นั้น เวลาไปห้าง ไปตลาดกับพวกเขา หน้าที่ผมคือไปช่วยยกของ ตอนเด็กๆ ผมคิดได้แค่นั้น ผมเกรงใจ ทั้งๆที่พวกเขาก็ถามนะ แต่ผมปฎิเสธตลอด</li>

        <li>23. เดี๋ยวนี้ยายผม เขาพูดดีกว่าเมื่อก่อนแล้ว แต่ก็ยังอารมณ์ ดีๆ ร้ายๆ แต่สมัยเรียน เขาไม่เคยพูดอะไรดีดี กับผมเลย นอกจาก บ่น ว่า ใส่อารมณ์ แต่ผมก็ต้องทน เพราะเขาให้เงินผมไปเรียน ถึงจะให้แบบขาดๆ จะขอซื้ออะไรที่จำเป็นก็ยากลำบากมาก ต้องพูดหลายครั้ง บ่อยครั้งก็ไม่ให้ จนผมต้องยืมเงินเพื่อนบ่อยๆ 
          แต่ถึงยังไง ถ้าไม่มีเขา ผมคงเรียนไม่จบ ตอนขึ้น ปี 3 ผมฝึกงานได้เงิน และไม่อยากรองรับอารมณ์เขาแล้ว เลยบอกเขาว่า ไม่ต้องให้เงินผมแล้ว
          ช่วง ปี 3 - ปี 4 เลยเป็นช่วงที่ชีวิตผมลำบากมากๆ เพราะไม่มีคนให้เงิน และต้องเรียนจนจบ เขาไม่เคยดูใบผลการเรียนผมด้วยซ้ำ งานรับปริญญาก็ไม่ไป เขาย้ายออกจากบ้านที่โปโลไปอยู่อ้อมน้อย หลังจากที่ผมบอกเขาว่า ไม่ต้องให้เงินผมใช้แล้ว ช่วงขึ้น ปี 3
        </li>
        <li>24. ตั้งแต่เรียนจบ มีรายได้ เวลาผมไปหายายที่อ้อมน้อย ผมเอาเงินไปให้ตลอดหลายครั้ง พอกลับมา ไม่ถึง 2 อาทิตย์ ก็โทรมาหาผมอีก ถามว่าเมื่อไหร่จะไปหา ทั้งที่ผมเพิ่งไปหา เอาเงินไปให้ และชอบโทรหาผม ตอน 10 โมง ซึ่งมันเป็นเวลาทำงาน เขาโทรหาผมเวลาทำงานบ่อยมาก ถ้าไม่รับ ก็จะโทรมารัวๆ พอบอกว่า ไม่ให้โทรมาเวลาทำงาน เขาก็จะหายไปช่วงนึง พอนานวันเข้าก็กลับมาโทรเวลาทำงานอีก (กลัวมีอะไรฉุกเฉินเลยทำอะไรไม่ได้)</li>
        <li>25. ยายผมเขาดีๆ ร้ายๆ บางวัน โทรหาผมพูดดี บางวันโทรมาใส่อารมณ์ บางวันวางสายใส่ บางวันโทรมาบอกมือไปโดน</li>
        <li>26. ผมไม่เคยได้เค้กวันเกิด หรือของขวัญวันเกิดจากครอบครัว</li>
        <li>27. ผมไม่เคยจับมือผู้หญิง ตลอด 30 ปีที่ผ่านมา และอาจจะตายจากโลกนี้ไปโดยไม่ได้จับมือผู้หญิง</li>
        <li>28. ผมเกิดมาไม่เคยไปร่วมงานแต่งงานใครเลย ไม่มีประสบการณ์</li>
        <li>29. ผมจ่ายค่าไฟที่บ้านมาตลอดหลายปี แต่ไม่เคยได้ใช้อะไรในบ้านเลย เพราะ ป้าเล็ก พูดจาไม่ดี ทั้ง ตู้เย็น หม้อข้าว กระติกน้ำร้อน </li>
        <li>30. ผมซื้อโต๊ะทำงานเข้าห้อง ป้าเล็กบอกว่าบ้านจะถล่ม สมัยก่อนเวลาผมทำงานหามรุ่งหามค่ำ กลับบ้านดึก ก็จะโดน Lock ประตูบ้านไม่ให้เข้า ผมเคยพังประตูบ้าน ก็เลยโดนบ่นแทน ทำงานเหนื่อยแล้ว กลับดึกยังต้องโดนบ่นอีกหรอ</li>
        <li>31. เวลาผมหิวตอนกลางคืน ผมจะออกไปเซเว่น ป้าเล็กก็จะหัวเราะฮึ เวลาผมเข้าห้องน้ำ ตอนกลางคืน ก็จะหัวเราะ ฮึ เวลาผมกลับบ้านดึก ก็จะบ่น บางทีก็หัวเราะฮึ ... ป้าเล็กเขาเป็นโรคประสาท</li>
        <li>32. ผมไม่ได้กินข้าวบ้านมาหลายปีแล้ว แต่เวลา มีคนมาบ้าน ป้าเล็กเขาจะสร้างภาพ เรียกผมกินข้าว เขาทำไปทำไม</li>
        <li>33. มีอยู่วันนึง ป้าเล็กเขาน้ำตาลลด นอนชักกับพื้น แล้วต้องเรียกรถพยาบาล ผมโทรเรียกรถพยาบาล และผมก็นั่งรถพยาบาลไปด้วย ตอนเขานอนเปลขึ้นรถพยาบาล ไม่ได้หยิบรองเท้าแตะไปด้วย เพราะรีบกันมาก ซึ่งเขาต้องนอนโรงพยาบาล พอวันต่อมา ผมเอารองเท้าแตะไปให้เขา เขาเขวี้ยงรองเท้า แล้วตะคอกใส่ผม ว่ามารับทำไม ต่อหน้าพยาบาล เยอะๆ เขาทำแบบนั้นไปทำไม นี่คือปมชีวิตที่ใหญ่มากของผม ผมอดทนมากๆวันนั้น</li>
        <li>34. ผมมีช่วงที่ออกจากบ้าน ใช้ชีวิตนอกบ้าน 3 เดือนกว่า ยายบอกว่าผมไม่สำนึกที่กินข้าวบ้าน ผมไม่ได้กินข้าวบ้านมาหลายปีแล้ว เขาไม่รู้จริงๆหรอ เขาไม่ได้อยู่กับผมตั้งแต่ขึ้นปี 3 เขาย้ายไปอยู่อ้อมน้อย หลายปีแล้ว ... อีกอย่าง คือ ไม่มีใครรู้ว่าผมไม่ได้อยู่บ้านมาเป็นเดือนแล้ว เพราะชีวิตที่ผ่านมาผมมีแต่ทำงาน นอน กินข้าวนอกบ้าน ไปเที่ยววันหยุดบ้าง เลยไม่ได้สุงสิงอะไรกับญาติคนไหนมากนัก </li>
        <li>35. ยาย กับป้าเล็ก มีนิสัย เหมือนกัน คือ พูดไม่คิด พูดเอาดีเข้าตัว และ มีนิสัยเอาแต่ได้ มีช่วงนึง ผมทำงานกลับมาบ้าน ป้าเล็กเขาพูดขึ้นมาว่า "เคยสนใจอะไรบ้างไหม" เขาพูดขึ้นมาทำไม ทั้งชีวิตเขาไม่เคยให้อะไรผมเลยนะ แต่คุณรู้ไหม หลังจากวันนั้น ผมจะออกจากบ้าน ผมก็จะถามเขาเกือบทุกวัน ว่าเอาอะไรไหม ส่วนใหญ่เขาก็จะตอบว่า "ไม่เอา" (ผมอยู่กับคนเป็นโรคประสาทจริงๆ) 
          แต่บางวันก็จะเอาขนมปัง ผมก็ซื้อมาให้ เวลามีเงินผมก็ให้นะ เพราะอยู่บ้านเดียวกัน
        </li>
        <li>36. ยายบอกญาติๆว่า เก็บเงินผมไว้ไม่ได้ใช้ แต่เขาไม่เคยบอกผมเลย ทำไมผมต้องมาได้ยินจากญาตินะ จริงๆเขาไม่ควรบอกใครเลยด้วยซ้ำ ผมอยากจะลืมๆมันไป เพราะสุดท้ายเงินพวกนั้น เขาก็ไม่ได้ให้ผมหรอก ผมเลยอยากลืมๆมันไป คือพูดให้ตัวเองดูดีเฉยๆ</li>


      </ul>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">นี่คือ ปมชีวิต ที่ผ่านมาของผม เดี๋ยวนี้ ป้าเล็กกับยาย คำพูดและการกระทำ เขาดีกว่าเมื่อก่อนละ แต่สิ่งที่พวกเขาเคยพูดและทำกับผมไว้ ที่ผ่านมา มันได้สร้างปมชีวิตให้ผมมากพอสมควร</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
      <p className="indent-6 text-base italic">
        มีญาติห่างๆถามผมว่า ถ้าทำงาน มีรายได้ แล้วทำไมไม่ออกมาเช่า ห้องอยู่ข้างนอก ผมสารภาพเลยว่า ผมเพิ่งคิดได้ ตอนทำงานบริษัทเดือนแรก ผมไม่มีค่ารถ ผมไม่มีค่าข้าว อาศัย เดินจากบ้านไปทำงานต้องออกแต่เช้า หิวก็กินน้้ำก๊อก พอเงินเดือนออกก็ให้แม่ตอบแทนที่มางานรับปริญญา
        จะเรียกว่า โง่มาหลายปีที่ทนอยู่กับพวกเขาไหม ผมก็ไม่แน่ใจ เอาจริงๆ ไม่อยากเสียค่าเช่าด้วยมั้ง เพราะยังมีบ้านให้อยู่ ตอนนั้นเลยไม่ได้คิดถึงจุดนี้
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">
        ผมอยากใช้พื้นที่นี้ จดบันทึกปมชีวิต ตัวเองไว้ เพราะเริ่มมีอายุมากขึ้น อาจจะลืมไป หรือความจำเริ่มผิดเพี้ยนก็ได้ พออายุมากขึ้น
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>
    <br />< br /><br />< br />
  </div>
}
