const langAuto = {
  stydy_life: {
    EN: 'Student Life',
    TH: 'ชีวิตสมัยเรียน',
    JP: 'がくせいじだい',
    CN: '学生时代'
  }
}

const AutoBiography = () => {
  const { lang, currentLanguage: l } = useContext(Context)
  return <div className="py-4">
    <style>{`

    ` + mobileCSS(`
      .ifr1 {
        
      }
    `) + desktopCSS(`
      .ifr1 {

      }
    `)}</style>

    <div className="fb_wrapper" style={{ display: "flex", flexDirection: "row", gap: '6px', justifyContent: 'center', flexWrap: 'wrap', width: '100%', minHeight: `${isFBApp ? '580px' : '520px'}` }}>
      <div style={{ width: '324px', height: `${isFBApp ? '580px' : '520px'}` }}>
        <span className="text-lg">FB 2010-2015 (ชีวิตวัยเรียน)</span>
        <a href="https://www.facebook.com/tor.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D692949137434104%26set%3Da.255540504508305&show_text=false&width=324"
            width="324" height={`${isFBApp ? '580px' : '520px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      <div style={{ width: '324px', height: `${isFBApp ? '510px' : '450px'}` }}>
        <span className="text-lg">FB 2016-2017 (ชีวิตทำงานปีแรกหลังเรียนจบ)</span>
        <a href="https://www.facebook.com/torn.onlyalone" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D378241239184959%26set%3Da.131442370531515&show_text=false&width=324"
            width="324" height={`${isFBApp ? '510px' : '450px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div>
      {/* <div style={{ width: '324px', height: `${isFBApp ? '403px' : '373px'}` }}>
        <span className="text-lg">FB 2017-2023 (ชีวิตการทำงานก่อนอายุ 30)</span>
        <a href="https://www.facebook.com/tron.json" target="_blank">
          <iframe src="https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fphoto%2F%3Ffbid%3D1359321627882023%26set%3Da.104674606680071&show_text=false&width=324"
            width="324" height={`${isFBApp ? '403px' : '373px'}`} style={{ overflow: 'hidden', pointerEvents: 'none', border: 'none' }} frameborder="0" ></iframe>
        </a>
      </div> */}
    </div>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4 py-4 sm:py-0">
      <p className="text-2xl"># ประวัติการย้ายโรงเรียน</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. กิตติมาศเนอร์สเซอรี่ อนุบาล 1 - อนุบาล 2 </li>
        <li>2. โรงเรียนวรรณวิทย์ ป.1 เทอม 1 </li>
        <li>3. โรงเรียนวัดอ่างแก้ว (จีบ ปานขำ) ป.1 เทอม 2 </li>
        <li>4. โรงเรียนวัดนิมมานรดี ป.2 - ป.5 </li>
        <li>5. โรงเรียนวัดคมบาง (เพิ่มพิทยากร) ป.6 </li>
        <li>6. โรงเรียนเบญจมราชูทิศ จันทบุรี ม.1 - ม.3</li>
        <li>7. โรงเรียนไตรมิตรวิทยาลัย ม.4 - ม.6 </li>
        <li>8. สถาบันการจัดการปัญญาภิวัฒน์ ปริญญาตรี</li>
      </ul>
    </article>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl"># ประวัติการย้ายที่อยู่อาศัย</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. ตอนเกิดอยู่บ้านยายที่ซอยโปโล จนถึงอนุบาล 2</li>
        <li>2. ป.1 เทอม 1 พ่อกับแม่ ย้ายไปอยู่บ้านเช่าไม่ไกล จากบ้านยาย</li>
        <li>3. ป.1 เทอม 2 ย้ายไปอยู่แฟลตข้าราชการ ที่บางแค </li>
        <li>4. ป.5 ช่วงปิดเทอม ย้ายไปอยู่บ้านป้าแอ๋ะ (พี่สาวพ่อ) ที่จันทบุรี </li>
        <li>5. ป.6 ย้ายไปอยู่บ้านย่า จนถึงจบ ม.3 </li>
        <li>6. ม.4 ย้ายกลับมาอยู่บ้านยาย ที่ซอยโปโล และอยู่มาจนถึงปัจจุบัน </li>
      </ul>

    </article>

    <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
    <br />

    <article className="px-4">
      <p className="text-2xl"># ญาติที่เคยอยู่ด้วยกัน เรียงลำดับตามความรักและผูกผันจากมากที่สุดไปน้อยที่สุด</p>
      <ul className="indent-6 py-2 text-sm">
        <li>1. พ่อตุ้ม อยู่กับผมตั้งแต่เกิดจนถึง ป.4 เทอม 1</li>
        <li>2. ตานัน อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึง ปัจจุบัน</li>
        <li>3. ย่า อยู่กับผม ช่วง ป.6 เป็นญาติที่อยู่กับผมสั้นมาก แต่ความทรงจำที่มีสวยงาม</li>
        <li>4. ลุงหมา กับพี่ทราย อยู่กับผมตั้งแต่ ป.6 จนถึงจบ ม.3</li>
        <li>5. ไอ้ตูมตาม เป็นหมาที่ผมรักมาก อยู่กับผมตั้งแต่ ป.6 จนถึง มัธยม</li>
        <li>6. ยายผอม อยู่กับผมตั้งแต่เกิด จนถึง อนุบาล 2 หลังจากนั้น กลับมาอยู่ด้วยกัน ตอนผมขึ้น ม.4 จนถึงมหาลัยปี 2</li>
        <li>7. ป้าเจ (แฟนใหม่พ่อ) อยู่กับผมตั้งแต่ ป.2 จนถึง ป.5 </li>
        <li>8. ญาติฝั่งพ่อคนอื่นๆ - ลุงแมว พี่เอ็ม ป้าแอ๋ะ ลุงปื๊ด ป้าตู่ ป้าเล็ก(ฝั่งพ่อ) น้องเป้ น้องกร</li>
        <li>9. ญาติฝั่งแม่คนอื่นๆ - ป้าอ้วน พี่ตั๊ก พี่ดี้ ไอดอน</li>
        <li>10. แม่ตุ๊ก อยู่กับผมตั้งแต่เกิดจนถึง ป.1 เทอม 2 ผมเอาแม่ไว้ข้อนี้ เพราะแม่ไม่ได้มีบทบาทอะไรกับชีวิตผมมากนัก นอกจากทำให้เกิดมาและทิ้งผมไป</li>
        {/* <li>11. ป้าเล็ก(ฝั่งแม่) ญาติเพียงคนเดียวในโลก ที่ผมใช้คำว่า "เกลียด" อยู่กับผมตั้งแต่เกิดจนถึง อนุบาล 2 และกลับมาอยู่ด้วยช่วงมหาลัย จนถึง ปัจจุบัน</li> */}
      </ul>
      {/* <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">นี่คือรายชื่อญาติที่ผมเคยอยู่ด้วย ปัจจุบันนี้อยู่แค่กับตานัน และป้าเล็กที่บ้านยายที่ซอยโปโล ส่วนญาติที่เหลือไม่ได้อยู่ด้วยกันเกิน 10 ปีแล้ว</p> */}
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>

    {/* <article className="px-4">
      <p className="text-2xl"># ปมชีวิต</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">ผมไม่อยากให้ตัวเองลืม "ปมชีวิต" เหล่านี้ หรือปล่อยให้หายไปตามกาลเวลา เมื่อผมเริ่มอายุมากขึ้น เลยเอามาพิมพ์ไว้ในนี้</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <ul className="indent-6 py-2 text-sm">
        <li>1. แม่พาไปขโมยของในห้าง ตอนเด็ก โดนเจ้าหน้าที่ห้างจับได้ จนพ่อต้องมาช่วย </li>
        <li>2. พ่อกับแม่ หย่ากัน ตอน ป.1 เทอม 2 แม่มีครอบครัวใหม่ ส่วนพ่อมีแฟนใหม่ คือ ป้าเจ ผมอยู่กับพ่อและแฟนใหม่พ่อ จนกระทั่ง พ่อเสียตอน ป.4 เทอม 1</li>
        <li>3. ตอนงานศพพ่อ แม่บอกญาติๆ ว่าเลี้ยงผมไม่ไหว ตอนนั้น ผมไม่ได้โกรธอะไรแม่ คิดแค่ว่า แม่มีครอบครัวใหม่ไปแล้ว เดี๋ยวผมอยู่กับญาติๆแทนก็ได้</li>
        <li>4. ตอน ป.4 เทอม 2 หลังงานศพพ่อ ป้าเจเคยทิ้งผมไว้ให้อยู่คนเดียว 1 อาทิตย์ กับเงิน 10 บาท และ ไวไว 1 แพค ไม่ได้บอกผมล่วงหน้าด้วยว่าจะกลับวันไหน ทิ้งไปดื้อๆ ผมคิดฆ่าตัวตายครั้งแรกในชีวิตคือตอนนั้น ผมไม่มีเงินกินข้าว ไปยืนจ้องไก่ย่างร้านส้มตำ จนแม่ค้าเขายอมให้ เพราะพ่อสอนว่าห้ามขโมย
          ถ้าตอนนั้น ป้าเจ ไม่กลับมา ผมน่าจะฆ่าตัวตายไปแล้ว ผมนอน เอามีดไว้ข้างตัวทุกคืน แต่ไม่ได้ฆ่าตัวตายเพราะกลัวเจ็บ
        </li>
        <li>5. ตอนที่ผมอยู่จันทบุรี ยายผมเขาได้กำชับ ญาติๆที่จันทบุรี ทางโทรศัพท์ว่า ห้ามให้ผมขี่ มอเตอร์ไซด์ ลุงเลยไม่ได้สอนและอนุญาติให้ผมขี่ ทั้งๆที่บ้านผมอยู่ในป่า ผมต้องเดินเท้าออกมาไกลมาก หมาก็ดุ เขาไม่ให้ผมขี่เพียงเพราะ ญาติเพื่อนเขาที่กรุงเทพ ประสบอุบัติเหตุ แต่เขาไม่ได้มองถึงชีวิตความเป็นอยู่ผมเลย</li>
        <li>6. ผมย้ายมาเรียนกรุงเทพ ตอน ม.4 เพราะคิดว่าย้ายมาอยู่กับยาย แล้วจะสบายขึ้น แต่จริงๆ คือลำบากกว่าเดิม มากๆ ผมขอเงินยายเอาไปปักตราโรงเรียนที่ร้าน สิ่งที่ยายให้ผมไม่ใช่เงินแต่เป็น ชุน กับ ด้าย
          ผมต้องอดหลับอดนอน เอา ชุน กับ ด้าย ปักตราโรงเรียนเอง ผลปรากฏว่า ตอนเข้าแถวที่โรงเรียน ครูดุผม แล้วสั่งให้ผมรื้อ ตอนนั้น ผมไม่ได้โกรธอะไรยาย แต่โกรธครูที่ไม่เข้าใจ ฐานะทางบ้านของผม
          (ถ้าผมอยู่กับญาติที่จันทบุรีต่อ ยังไง ลุงหมา ก็ให้เงิน ไปปักที่ร้าน ผมเริ่มรู้สึกว่าโดนยายหลอกมาอยู่ด้วยที่กรุงเทพ ตั้งแต่เหตุการณ์ครั้งนั้น)
        </li>
        <li>7. ช่วง ม.4 ผมตั้งใจเรียน จนได้ที่ 1 ของ สาย ศิลป์-คำนวณ แต่ไม่มีใครชมอะไรผมเลย เสาร์ อาทิตย์ผมอยู่บ้าน อ่านหนังสือ ปัดกวาดบ้าน ทำงานบ้าน ก็เอาแต่บ่นว่า ผมอยู่แต่บ้าน</li>
        <li>8. ผมอ่านหนังสือเรียน อ่านหนังสือสอบ จนดึกดื่น ก็บ่นว่า ไม่รู้จักหลับจักนอน เสาร์-อาทิตย์ นอนตื่นสาย ก็เอาไม้กระทุ้งพื้นห้องผม ให้ผมตื่น </li>
        <li>9. ผมโตมากับการยืมเงินเพื่อนๆ และยืมของเพื่อน เพราะทางบ้านมักไม่ค่อยเข้าใจ อย่างเช่น ต้องซื้อกระดาษ ซื้ออุปกรณ์เครื่องเขียน หรือแม้แต่ไป ทัศนศึกษาผมก็ไม่มีเงินพิเศษ อะไร บางวันก็ไม่ได้ค่าขนมไปเรียน ก็ต้องยืมเพื่อน </li>
        <li>10. ตอน จบ ม.6 ไม่มีใครสนับสนุนให้ผมเรียนต่อมหาลัย ผมสอบได้ทุน จึงมีโอกาสได้เรียน (ผมเพิ่งมาได้ยิน และรู้จักคำว่า กยศ. ภายหลัง ตอนนั้น ยังกลัวการเป็นหนี้เยอะๆ เพราะไม่มีใครส่งเสีย)</li>
        <li>11. ผมเคยได้เงินมากสุดในชีวิต คือ 10000 บาท เพียง 1 ครั้งในชีวิต คือขอยายซื้อ โน๊ตบุ๊ค เอาไว้ทำงาน+เขียน code สมัยเรียน มหาลัย ซึ่ง ตอน ปี 1 ผมอาศัยยืมของเพื่อน ซึ่งต้องขอหลายครั้งกว่ายายจะยอมให้</li>
        <li>12. ผมต้องอาศัย นอนบ้านเพื่อน และ หอเพื่อน แถวมหาลัย เพื่อประหยัดค่าเดินทาง ในการไปเรียน</li>
        <li>13. ผมไม่ได้ขอเงินยาย ตั้งแต่ขึ้น ปี 3 เพราะยายพูดจาไม่ดีมาตลอด + ป้าเล็กบอกว่าผมเรียนไม่จบหรอก ผมโมโห เลยเลิกพึ่งพาพวกเขา และเรียนจนจบ</li>
        <li>14. ช่วงที่ยังเรียนไม่จบแล้วไม่ได้ขอเงินยายแล้ว มีบางช่วงที่ เงินฝึกงานได้ช้า ผมต้องเดินไป-กลับจากบ้าน ไปรัชดา ไม่มีค่ารถ ไม่มีค่าข้าว อยู่เป็นหลายวัน ทำอะไรไม่ได้นอกจากอดทน เดินออกจากบ้านตี 3 เดินกลับบ้าน 2 ทุ่ม</li>
        <li>15. ไม่มีญาติคนไหนเลย มางานรับปริญญาของผม จนผมต้องให้แม่มา เพราะไม่มีใครมาเลย แม้แต่ยาย ทั้งๆที่แม่ไม่ได้ส่งเสียอะไรผมเลย</li>
        <li>16. ตอนเงินเดือนออก เดือนแรก ผมให้เงินแม่ ตอบแทนที่มางานรับปริญญาผม แต่ตลอดหลายปีที่ผ่านมา แม่ทักแชทมามีแต่ยืมเงิน ไม่มีเรื่องอื่น นอกจากยืมเงิน ถ้ามีผมก็โอนให้ตลอด แต่แม่ไม่เคยถามสารทุกข์ สุขดิบ อะไรผมเลย ในแชทมีแต่เรื่องยืมเงินอย่างเดียว ของเก่าไม่คืน ยังทักมายืมของใหม่ด้วยซ้ำ</li>

        <li>17. ผมไม่มีความทรงจำ เลือกซื้อเสื้อผ้า กับครอบครัว ผมโตมากับเสื้อผ้า ที่เป็นของใครไม่รู้ แม้แต่หลังเรียนจบ ทำงานบริษัทเดือนแรก ไม่มีแม้กระทั่งเสื้อผ้าไปทำงาน ต้องรอเงินเดือนออก เพื่อซื้อเสื้อเชิ๊ต ตอนทำงานเดือนแรก ก็ต้องเดิน ไป-กลับ จากบ้าน ไปอโศก ไม่มีค่ารถ ไม่มีค่าข้าว</li>
        <li>18. ตั้งแต่ขึ้นมหาลัย จนเรียนจบทำงาน ในแต่ละปี ผมกินข้าวกับเพื่อนสมัยเรียน หรือเพื่อนร่วมงาน มากกว่าครอบครัว</li>
        <li>19. ผมไม่มีความทรงจำ กินข้าวนอกบ้านกับครอบครัว ที่นึกออกมีแค่พายายไปเลี้ยงข้าวที่ห้าง 1 ครั้ง หลังจากพายายไปทำธุระ กับญาติพาไปกินข้าวที่ทะเล ที่ลอยอังคารพ่อ เมื่อหลาย 10 ปีก่อน ตอนเด็ก 1 ครั้ง</li>
        <li>20. ผมไม่ได้กินข้าวบ้าน ตั้งแต่มีรายได้ ก่อนเรียนจบก็นานๆกินที ไม่ได้กินทุกวัน</li>
        <li>21. ผมนึกไม่ออกว่าเคยไปเที่ยวกับครอบครัว และยิ้มอย่างมีความสุข ครั้งแรกและล่าสุดคือที่ไหน น่าจะเป็นตอนพ่อพาไปงานวันเด็กที่ กองทัพอากาศสมัยประถม</li>
        <li>22. ชีวิตผม ย้ายบ้าน ย้ายโรงเรียน มาหลายครั้ง อยู่กับญาติมาหลายคน ผมไม่เคยขออะไรไร้สาระจากพวกเขาเลย เสื้อผ้า ขนม หรือสิ่งที่อยากกิน นอกจากสิ่งที่จำเป็นกับการเรียนแค่นั้น เวลาไปห้างหรือไปตลาดกับพวกเขา หน้าที่ผมคือไปช่วยยกของ ตอนเด็กๆ ผมคิดได้แค่นั้น ผมเกรงใจ ทั้งๆที่พวกเขาก็ถามนะ แต่ผมปฎิเสธตลอด (ตอนนั้น ผมคิดแต่ว่าตัวเองเป็น แค่ผู้อาศัย)
        </li>

        <li>23. เดี๋ยวนี้ยายผม เขาพูดดีกว่าเมื่อก่อนแล้ว แต่สมัยเรียน เขาไม่เคยพูดอะไรดีดี กับผมเลย นอกจาก บ่น ว่า ใส่อารมณ์ แต่ผมก็ต้องทน เพราะเขาให้เงินผมไปเรียน ถึงจะให้แบบขาดๆ จะขอซื้ออะไรที่จำเป็นก็ยากลำบากมาก ต้องพูดหลายครั้ง บ่อยครั้งก็ไม่ให้ จนผมต้องยืมเงินเพื่อนบ่อยๆ
          แต่ถึงยังไง ถ้าไม่มีเขา ผมคงเรียนไม่จบ ตอนขึ้น ปี 3 ผมฝึกงานได้เงิน และไม่อยากรองรับอารมณ์เขาแล้ว เลยบอกเขาว่า ไม่ต้องให้เงินผมแล้ว
          ช่วง ปี 3 - ปี 4 เลยเป็นช่วงที่ชีวิตผมลำบากมากๆ เพราะไม่มีคนให้เงิน และต้องเรียนจนจบ เขาไม่เคยดูใบผลการเรียนผมด้วยซ้ำ งานรับปริญญาก็ไม่ไป เขาย้ายออกจากบ้านที่โปโลไปอยู่อ้อมน้อย หลังจากที่ผมบอกเขาว่า ไม่ต้องให้เงินผมใช้แล้ว ช่วงขึ้น ปี 3
        </li>
        <li>24. ตั้งแต่เรียนจบ มีรายได้ เวลาผมไปหายายที่อ้อมน้อย ผมเอาเงินไปให้ตลอดหลายครั้ง พอกลับมา ไม่ถึง 2 อาทิตย์ ก็โทรมาหาผมอีก ถามว่าเมื่อไหร่จะไปหา ทั้งที่ผมเพิ่งไปหา เอาเงินไปให้ และชอบโทรหาผม ตอน 10 โมง ซึ่งมันเป็นเวลาทำงาน เขาโทรหาผมเวลาทำงานบ่อยมาก ถ้าไม่รับ ก็จะโทรมารัวๆ พอบอกว่า ไม่ให้โทรมาเวลาทำงาน เขาก็จะหายไปช่วงนึง พอนานวันเข้าก็กลับมาโทรเวลาทำงานอีก (กลัวมีอะไรฉุกเฉินเลยทำอะไรไม่ได้)</li>
        <li>25. ยายผมเขาดีๆ ร้ายๆ บางวัน โทรหาผมพูดดี บางวันโทรมาใส่อารมณ์ บางวันวางสายใส่ บางวันโทรมาบอกมือไปโดน</li>
        <li>26. ผมไม่เคยได้เค้กวันเกิด หรือของขวัญวันเกิดจากครอบครัว</li>
        <li>27. ผมไม่เคยจับมือผู้หญิง ตลอด 30 ปีที่ผ่านมา และอาจจะตายจากโลกนี้ไปโดยไม่ได้จับมือผู้หญิง</li>
        <li>28. ผมเกิดมาไม่เคยไปร่วมงานแต่งงานใครเลย ไม่มีประสบการณ์</li>
        <li>29. ผมจ่ายค่าไฟที่บ้านมาตลอดหลายปี แต่ไม่เคยได้ใช้อะไรในบ้านเลย เพราะ ป้าเล็ก พูดจาไม่ดี ทั้ง ตู้เย็น หม้อข้าว กระติกน้ำร้อน </li>
        <li>30. ผมซื้อโต๊ะทำงานเข้าห้อง ป้าเล็กบอกว่าบ้านจะถล่ม สมัยก่อนเวลาผมทำงานหามรุ่งหามค่ำ กลับบ้านดึก ก็จะโดน Lock ประตูบ้านไม่ให้เข้า ทำงานเหนื่อยแล้ว กลับดึกยังต้องโดนบ่นอีกหรอ</li>
        <li>31. เวลาผมหิวตอนกลางคืน ผมจะออกไปเซเว่น ป้าเล็กก็จะหัวเราะฮึ เวลาผมเข้าห้องน้ำ ตอนกลางคืน ก็จะหัวเราะ ฮึ เวลาผมกลับบ้านดึก ก็จะบ่น บางทีก็หัวเราะฮึ ... ป้าเล็กเขาเป็นโรคประสาท</li>
        <li>32. ผมไม่ได้กินข้าวบ้านมาหลายปีแล้ว แต่เวลา มีคนมาบ้าน ป้าเล็กเขาจะสร้างภาพ เรียกผมกินข้าว เขาทำไปทำไม</li>
        <li>33. มีอยู่วันนึง ป้าเล็กเขาน้ำตาลลด นอนชักกับพื้น แล้วต้องเรียกรถพยาบาล ผมโทรเรียกรถพยาบาล และผมก็นั่งรถพยาบาลไปด้วย ตอนเขานอนเปลขึ้นรถพยาบาล ไม่ได้หยิบรองเท้าแตะไปด้วย เพราะรีบกันมาก ซึ่งเขาต้องนอนโรงพยาบาล พอวันต่อมา ผมเอารองเท้าแตะไปให้เขา เขาเขวี้ยงรองเท้า แล้วตะคอกใส่ผม ว่ามารับทำไม ต่อหน้าพยาบาล เยอะๆ เขาทำแบบนั้นไปทำไม นี่คือปมชีวิตที่ใหญ่มากของผม ผมอดทนมากๆวันนั้น</li>
        <li>34. ผมมีช่วงที่ออกจากบ้าน ใช้ชีวิตนอกบ้าน 3 เดือนกว่า ยายบอกว่าผมไม่สำนึกที่กินข้าวบ้าน ผมไม่ได้กินข้าวบ้านมาหลายปีแล้ว เขาไม่รู้จริงๆหรอ เขาไม่ได้อยู่กับผมตั้งแต่ขึ้นปี 3 เขาย้ายไปอยู่อ้อมน้อย หลายปีแล้ว ... อีกอย่าง คือ ไม่มีใครรู้ว่าผมไม่ได้อยู่บ้านมาเป็นเดือนแล้ว เพราะชีวิตที่ผ่านมาผมมีแต่ทำงาน นอน กินข้าวนอกบ้าน ไปเที่ยววันหยุดบ้าง เลยไม่ได้สุงสิงอะไรกับญาติคนไหนมากนัก </li>
        <li>35. ยาย กับป้าเล็ก มีนิสัย เหมือนกัน คือ พูดไม่คิด พูดเอาดีเข้าตัว และ มีนิสัยเอาแต่ได้ มีช่วงนึง ผมทำงานกลับมาบ้าน ป้าเล็กเขาพูดขึ้นมาว่า "เคยสนใจอะไรบ้างไหม" เขาพูดขึ้นมาทำไม ทั้งชีวิตเขาไม่เคยให้อะไรผมเลยนะ แต่คุณรู้ไหม หลังจากวันนั้น ผมจะออกจากบ้าน ผมก็จะถามเขาเกือบทุกวัน ว่าเอาอะไรไหม ส่วนใหญ่เขาก็จะตอบว่า "ไม่เอา" (ผมอยู่กับคนเป็นโรคประสาทจริงๆ)
          แต่บางวันก็จะเอาขนมปัง ผมก็ซื้อมาให้ เวลามีเงินผมก็ให้นะ เพราะอยู่บ้านเดียวกัน
        </li>
        <li>36. ยายบอกญาติๆว่า เก็บเงินผมไว้ไม่ได้ใช้ แต่เขาไม่เคยบอกผมเลย ทำไมผมต้องมาได้ยินจากญาตินะ จริงๆเขาไม่ควรบอกใครเลยด้วยซ้ำ ผมอยากจะลืมๆมันไป เพราะสุดท้ายเงินพวกนั้น เขาก็ไม่ได้ให้ผมหรอก ผมเลยอยากลืมๆมันไป คือพูดให้ตัวเองดูดีเฉยๆ</li>


      </ul>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">นี่คือ ปมชีวิต ที่ผ่านมาของผม เดี๋ยวนี้ ป้าเล็กกับยาย คำพูดและการกระทำ เขาดีกว่าเมื่อก่อนละ แต่สิ่งที่พวกเขาเคยพูดและทำกับผมไว้ ที่ผ่านมา มันได้สร้างปมชีวิตให้ผมมากพอสมควร</p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">
        มีญาติห่างๆถามผมว่า ถ้าทำงาน มีรายได้ แล้วทำไมไม่ออกมาเช่า ห้องอยู่ข้างนอก ผมสารภาพเลยว่า ผมเพิ่งคิดได้ ตอนทำงานบริษัทเดือนแรก ผมไม่มีค่ารถ ผมไม่มีค่าข้าว อาศัย เดินจากบ้านไปทำงานต้องออกแต่เช้า หิวก็กินน้ำก๊อก พอเงินเดือนออกก็ให้แม่ตอบแทนที่มางานรับปริญญา
        จะเรียกว่า โง่มาหลายปีที่ทนอยู่กับพวกเขาไหม ผมก็ไม่แน่ใจ เอาจริงๆ ไม่อยากเสียค่าเช่าด้วยมั้ง เพราะยังมีบ้านให้อยู่ ตอนนั้นเลยไม่ได้คิดถึงจุดนี้
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <p className="indent-6 text-base italic">
        ผมอยากใช้พื้นที่นี้ จดบันทึกปมชีวิต ตัวเองไว้ เพราะเริ่มมีอายุมากขึ้น อาจจะลืมไป หรือความจำเริ่มผิดเพี้ยนก็ได้ พออายุมากขึ้น
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article> */}

    <article className="px-4">
      <p className="text-2xl"># 1. ความทรงจำ ก่อนขึ้น ป.6</p>
      <p className="indent-6 text-sm">
        ภาพแรกในความทรงจำ คือผมอยู่ในมุ้งกับพ่อแม่ ที่บ้านยายที่กรุงเทพ บ้านไม้ 2 ชั้น หน้าบ้านมีต้นเฟื่องฟ้า ผมอยู่ชั้นล่างเวลานอน ชั้นบนเป็นห้องของยาย
        ตอนเด็กๆ คนที่บ้าน มี พ่อ แม่ ตา ยาย น้า และ ป้า (พ่อผมเป็นพุทธ แม่ผมและญาติฝั่งแม่ทั้งหมดเป็นอิสลาม บ้านยายผมเป็นอิสลาม)
        พ่อผมชื่อตุ้มทำงาน สนง. ทรัพย์สินฯ แผนกรางวัด เป็นคนจันทบุรีที่มาทำงานกรุงเทพ มาพบรักกับแม่ผมที่กรุงเทพ
        ยายผมชื่อผอมทำงานบริษัท ขายปุ๋ย แถวท่าน้ำราชวงศ์
        ป้าผมที่ชื่อเล็ก ชอบหยิกผม เวลาคนอื่นไม่เห็น ไม่รู้เพราะหมั่นไส้ หรืออะไร ผมจะร้องไห้ เวลาโดนเขาหยิก แต่ทำอะไรไม่ได้ (ป้าเล็กเป็นคนจิตไม่ปกติ)
        ตอนเด็กๆ คนที่บ้านให้กินนมตราหมีกระป๋องสีเหลืองบ่อยมาก  ส่วน ตาที่บ้านชอบซื้อข้าวมันไก่ ให้ผมกิน ข้าวมันไก่คือของโปรดตั้งแต่ตอนเด็กๆ
        คนที่บ้านชอบเปิดเพลง ติง นัง นัง ให้ผมเต้นตาม ตอนเด็กๆ พอ ได้ยินเพลง ติง นัง นัง ผมก็จะเต้นตาม
        เวลาผ่านไป ผมก็เริ่มเข้าอนุบาล 1 โรงเรียนกิตติมาสเนอสเซอรี่ ไม่ไกลจากบ้านยายมากนัก
        ตอนนั้น ไม่รู้ทำไม อยู่ๆ พ่อกับแม่ก็ย้ายออกจากบ้านยาย ไปอยู่บ้านเช่า ที่ไม่ไกลกับบ้านยายมากนัก
        ตาผมที่อยู่บ้านยาย เขาจะขี่จักรยานมาหาผม กับแม่ ที่บ้านเช่า บ่อยๆ บางวันก็รับ-ส่งผมจากโรงเรียน
        ตอนนั้น ผมชอบแอบเดินไปบ้านยาย บ่อยๆ ไม่ไกลกันมาก เพราะผมไม่เข้าใจว่า ทำไม พ่อกับแม่ ต้องย้ายออกมา ผมคิดถึงตากับยาย
        ผมอยู่ห้องเช่า กับพ่อแม่ แค่ 3 คน ห้องก็เล็กกว่าบ้านยาย แคบมาก ตั้งแต่ อนุบาล จนถึง ป.1 เทอม 1
        ตอนผมขึ้น ป.1 ผมย้ายโรงเรียนจาก กิตติมาสเนอเซอรี่ มาที่ โรงเรียน วรรณวิทย์
        ตอนป.1 ผมเป็นโรคเวลาอยู่หน้าประตูโรงเรียน จะชอบ อ๊วก แล้วไม่อยากเข้าไปในโรงเรียน
        มีอยู่วันนึง ผมอึราดกางเกง เพราะไม่กล้าเข้าห้องน้ำโรงเรียน แล้วผมนั่งเนียนในห้องเรียน ครูต้องให้ เด็กทุกคนในห้องยืน และครูดมกางเกงทีละคน จนมาถึงผม ผมเลยต้องยอมรับว่าอึราดกางเกง
        ตาเป็นฮีโร่ ขี่จักรยาน มารับผมกลับบ้าน พาผมมาล้างตูดที่บ้านยาย
        ผมอยู่ห้องเช่ากับ พ่อแม่ สักพักใหญ่ - จนขึ้น ป.1 เทอม 2 พ่อแม่และผม ก็ได้ย้าย จาก ห้องเช่าเล็กๆ  มาอยู่ แฟลต ที่พักข้าราชการ ของ สน.ทรัพย์สิน แถว บางแค
        เป็นสวัสดิการ ของพ่อผม ผมย้ายมาไกลเลย
        ผมต้องจากลา ตา กับ ยาย + ญาติฝั่งแม่ เพราะย้ายมาไกล เดินไปหาไม่ได้แล้ว
        ตอน ป.1 เทอม 2 ผมย้ายไปเรียนที่โรงเรียนวัดอ่างแก้ว (จีบ ปานขำ)
        ตอนเช้า พ่อจะพาไปโรงเรียน ด้วยการนั่งเรือ จากท่าน้ำวัดนิม ผมตื่นเต้นมากได้นั่งเรือไปเรียน (พ่อผมนั่งเรือไปทำงาน แต่ผมจะลงก่อนพ่อ พ่อจะลงท่าเรืออื่น ผมก็เดินเข้าโรงเรียนเอง)
        แต่ว่า ตอนกลับจากโรงเรียน แม่จะนั่งรถไปรับตอนเย็น
        ชีวิตของผม มีความทรงจำบางอย่าง ที่ไม่ดี เกี่ยวกับแม่ แต่ตอนนั้น ผมเด็กมาก เลยไม่ค่อยเข้าใจอะไรมาก คือที่แม่ไปขโมยของที่ห้าง จนพ่อต้องไปเคลียร์ให้
        ตอนนั้น ผมถามแม่ว่า แม่ไม่จ่ายตังหรอ แม่เอาของในห้างซุก แล้วเดินออกจากห้างเลย
        มีอยู่วันนึงผมเลิกเรียน แล้ว แม่ผมเขา ไม่ยอมนั่งรถ มารับผมกลับบ้าน วันนั้น ผมรอแม่นานมากๆ จนฟ้ามืด ผมยังอยู่ที่โรงเรียนวัดอ่างแก้ว ผู้ปกครองของเพื่อนผม เขาเจอผมแล้วถามผมว่า บ้านผมอยู่ไหน ผมต้องพยายามอธิบาย ว่าผม อยู่แฟลต สีขาวๆ มี 3 แฟลต เขาจึงพาผมมาส่งกลับที่ แฟลตได้ เขาต้องถามคนแถวนั้น ช่วยกันหาบ้านที่ผมอยู่
        ถ้าไม่ได้ผู้ปกครองเพื่อนวันนั้น ผมคิดไม่ออกว่า จะเป็นยังไงกับชีวิต วันนั้น แม่ไม่ยอมไปรับผมที่โรงเรียน
        หลังจากนั้น แม่ก็กลับไปรับผมที่โรงเรียนตามปกติ
        ต่อมาไม่นาน ในคืนนึง พ่อกับแม่ทะเลาะกัน พ่อเตะแม่ และ แม่ก็ เก็บกระเป่า หนีออกไปเลย ตอนนั้น ผมโกรธพ่อเพราะพ่อเตะแม่ทำไม
        หลังจากแม่ ออกไปแล้ว ผ่านไปไม่นาน พ่อก็มีแฟนใหม่ ผมเรียกเขาว่าป้า เพราะเขาอายุเยอะกว่าพ่อผม แรกๆผมก็ไม่ชอบเขา แต่เวลาผ่านไปนานๆ ก็ปรับตัวอยู่ด้วยกันได้ เขาชื่อป้าเจ
        พอ ขึ้น ป.2 ผมค่อนข้างเกเร เอาเงินทำบุญไปซื้อไพ่ยูกิ พอกลับมาบ้าน ผมเอาจดหมายเชิญผู้ปกครองไปทิ้งขยะ ป้าเจ ให้ผมไปค้นขยะเอาจดหมายกลับมา พอพ่อกลับมา พ่อก็ฟาดผมด้วยเข็มขัดไม่ยั้ง
        เพราะผมเอาเงินทำบุญ ไปซื้อไพ่ยูกิ หลังจากนั้น ผมก็ไม่ทำไม่ดีอีกเลย ผมกลายเป็นเด็กดีมากๆ หลังจากเหตุการณ์ครั้งนั้น
        พอขึ้น ป.3 -  ป.4 ชีวิตผมก็เหมือนเด็กธรรมดาทั่วไป เวลาปิดเทอม ผมก็จะขอพ่อไปอยู่บ้านยาย เปิดเทอมก็กลับมาอยู่กับ พ่อและป้าเจที่บางแค
        (ตอน ป.3 ผมสอบได้ที่ 9 ตั้งใจเรียนมากๆ ทั้งห้องมี 30 กว่าคน) (ตอนป.2 ผมสอบได้ที่ 34 ทั้งห้องมี 35 คน คือรองบ๋วย)
        ช่วงปิดเทอม ตอน ป.4 เทอม 1 ผมมาอยู่บ้านยาย แล้วป้าเจ ก็โทรมาที่บ้านยาย บอกว่าพ่อผมเสียแล้ว ชีวิตของผมเริ่ม เหมือนตกนรกทั้งเป็นมาทีละนิดตั้งแต่ตอนนั้น
        (พ่อผม กินเหล้าเก่ง เสียเพราะหัวใจวายเฉียบพลัน)
        พ่อผมเป็นคนจันทบุรี ที่มาทำงานกรุงเทพ ศพของพ่อ ได้ถูดจัดงาน ที่วัดคมบาง จันทบุรี ตอนงานศพพ่อ แม่บอกญาติๆว่า เลี้ยงผมไม่ไหว
        ตอนนั้น ผมเด็กมากๆ และคิดแค่ว่า ผมเก่งคงเอาตัวรอดได้ แม่ไม่เลี้ยงก็ไม่เป็นไร (ตอนนั้น แม่ผมเขาก็มีแฟนใหม่ มีครอบครัวใหม่ไปแล้ว)
        ผมยังคงอยู่กับ ป้าเจ 2 คน ตั้งแต่ ช่วง ป.4 เทอม 2 จน จบ ป.5 เพราะได้มีการขอ ทางแฟลต ไว้ว่า ให้ผมเรียนจบ ป.5 ก่อนถึงย้ายออก
        ช่วงตั้งแต่ ป.4 เทอม 2 จากที่ผมเคยได้เงินไปเรียน วันละ 40-100 บาท ก็เหลือ ได้วันละ 10-20 บาท ตอนพ่อผมเสีย พ่อผม เขาผ่อนบ้านอยู่ เงินประกันอะไรต่างๆต้องเอาไปจ่ายหนี้ของพ่อทั้งหมด
        ผมไม่ได้อะไรเลย
        ป้าเจก็เริ่มไม่ค่อยอยู่บ้านบ่อยๆ ผมต้องหารายได้เสริม ด้วยการขายขนม และหนังสือการ์ตูน ที่มีคนเขาสงสารให้มาขาย
        เวลาอยู่ที่โรงเรียน ช่วงพักเที่ยง ผมไม่มีตัง กินขนมแบบเพื่อนๆ ไปซื้อของสหกรณ์ เหมือนแต่ก่อน
        กลับมาบ้านตอนเย็น หิวข้าวแค่ไหน ก็ต้องรอป้าเจเลิกงานกลับมาบ้าน เอากับข้าวมาให้ ถ้ามี ไวไว ก็พอต้มกินแก้หิวได้
        ผมนั่งทำการบ้าน คนเดียว โดยไม่มีคนให้คอยถาม อีกแล้ว (ผมจะชอบนั่งทำการบ้านในที่แสงสลัวเพราะคิดว่าพ่อจะกลับมาสอนผม)
        มีอยู่อาทิตย์นึง ป้าเจ ทิ้งเงินไว้ให้ผมแค่ 10 บาท กับ ไวไว อีก 1 แพ็ค
        ผมต้องอดข้าวเช้าไปโรงเรียน (จริงๆหลังจากพ่อเสียผมก็ อดมือกินมื้อกับข้าวเช้าและ) ยังโชคดีที่ โรงเรียนมีข้าวกลางวันให้กิน
        พอผมกลับมาถึงบ้าน มีไวไวแค่ 1 แพค ตอนแรกผมคิดว่า 1-2 วัน ป้าเจก็คงกลับมา
        พอเข้าวันที่ 3-4 ผมเริ่ม แบ่งไวไว กินทีละครึ่งซอง  และเริ่มกลัว และจิตตก ตอนกลางคืนที่ผมนอนอยู่คนเดียว ผมเอามีด วางไว้ ข้างตัว จะฆ่าตัวตายละ นั่นเป็นการคิดฆ่าตัวตายครั้งแรกในชีวิตของผม
        แต่ตอนนั้น ผมกลัวเจ็บ ถ้าผมไม่กลัวเจ็บ คิดไม่ออกเลยว่า ตอนนั้น ผมจะฆ่าตัวตายไหม
        ผ่านไป 5 วัน ป้าเจเขาก็ยังไม่กลับมา
        จนวันเสาร์ ผมหิวมาก เงินก็ไม่มี ผมไปยืนจ้องไก่ย่าง ที่ร้านแม่ค้าส้มตำ พ่อผมเคยสอนไว้ว่า อย่าขโมยของคน
        ผมเลยยืนจ้องเป็นชั่วโมง จ้องด้วยความหิวและอาฆาต เหมือนสัตว์ป่าที่ดุร้าย จนแม่ค้าเขายอมให้ไก่ผม
        พอ วันอาทิตย์ ป้าเจก็กลับมา ป้าเขาหายไปเป็นอาทิตย์เลย (ผมคิดไม่ออก จริงๆว่า ถ้า ผ่านไป 1 อาทิตย์แล้วป้าเจยังไม่กลับมา ชีวิตผมจะเป็นยังไง)
        ผมใช้ชีวิตอยู่กับป้าเจ จนเรียนจบ ป.5 ผมต้องย้ายออกจากแฟลต และได้ย้ายไปอยู่กับญาติฝั่งพ่อ ที่จันทบุรี ตอน ป.6
        ทิ้งชีวิต ความเป็นเด็กกรุงเทพ ไปเป็นเด็กต่างจังหวัด ส่วนป้าเจ น่าจะกลับไปอยู่บ้านเขาเหมือนเดิม
        นี่คือ ชีวิต ของผมก่อนขึ้น ป.6 ทั้งหมด เท่าที่ผมจะจำความได้
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>

    <article className="px-4">
      <p className="text-2xl"># 2. ความทรงจำ ป.6 - ม.3 ที่จันทบุรี</p>
      <p className="indent-6 text-sm">
        พอจบ ป.5 ช่วงปิดเทอม ผมก็ได้ย้ายไปอยู่กับ ญาติฝั่งพ่อ ที่จันทบุรี ได้ไปอยู่บ้านป้าแอ๊ะ (พี่สาวพ่อ) ป้าแอ๋ะ นิสัยดี ไม่มีอะไร
        ในบ้านก็จะมี ป้าแอ๋ะ แฟนป้าแอ๋ะ (ลุงปื๊ด) และก็ ลูกชายอีก 2 คน (พี่เอ็ม น้องเป้)
        ผมทะเลาะกับ น้องเป้ ค่อนข้างบ่อย จะมีพี่เอ็ม คอย เป็นคนเคลียร์ ปัญหา พี่เอ็มเป็นคนที่นิสัยดีมากๆ สำหรับผม
        ช่วงที่ผมอยู่บ้านป้าแอ๋ะ ผมจะอยู่ด้วยความรู้สึกเกรงใจ ผมเป็นเด็กที่มาอาศัยญาติอยู่ เวลาพวกเขาไปเที่ยว ผมมักจะขอไม่ไปด้วย
        ผมจะขอเฝ้าบ้านให้พวกเขา เวลาที่พวกเขาไม่อยู่บ้านเพราะไปเที่ยว
        ผมจะคอย กวาดบ้าน ล้างจาน ถูบ้าน จัดบ้านให้พวกเขา นั่นคือสิ่งที่ผมจะทำได้ในฐานะผู้อาศัย
        เวลากินข้าวตอนเย็น ผมมักจะอ้างว่าไม่หิว ให้ญาติๆผมกินให้เสร็จก่อน
        ผมจะรอกินคนสุดท้ายตลอด ตามแต่ว่าพวกเขาจะเหลือไว้ให้ผมเท่าไหน ผมก็กินเท่านั้น
        ผมเคยทะเลาะกับเป้ แล้ว มีวันนึง กับข้าวหมด ผมต้องนอนท้องกิ่ว ทั้งคืน แต่ผมก็ทน
        พอขึ้น ป.6 ผมก็ได้ย้ายบ้านอีกครั้ง จากบ้าน ป้าแอ๊ะ ย้ายมาอยู่บ้านย่า ที่อยู่คนละ ตำบล (ผมเป็นเด็กกรุงเทพ ครั้งแรกงงกับคำว่า ตำบลมาก)
        ที่บ้านย่า จะมี ลุงหมา ลุงแมว ย่า และก็ หลานลุงหมา
        ผมอยู่บ้านนี้ 4 ปี มีโทรคุยกับ ยาย และก็แม่ ที่กรุงเทพบ้าง กับแม่คุยแค่ช่วงย้ายมาปีแรก แล้วแม่ก็หายไปจากชีวิตของผม แต่กับยาย โทรคุยมาตลอด 4 ปี
        จากเด็กกรุงเทพ ที่ทั้งโรงเรียน มีนักเรียน หลักพันคน ในห้อง ก็ 30 กว่าคน มาสู่โรงเรียน วัดคมบาง ที่ ทั้งห้อง มีนักเรียนไม่ถึง 10 คน ทั้งโรงเรียนตอนนั้น จำไม่ได้ ว่า ถึง 100 คนไหม
        ที่บ้านย่า ผมเลี้ยงหมา  ตลอด 4 ปี ที่อยู่บ้านย่า ผมผูกผันกับหมาสุดละ ผมมักจะชอบขี่จักรยาน ข้าม ตำบล หมาก็จะวิ่งตามผมไปด้วย ผมรักหมามาก
        ผมเรียนรู้การใช้ชีวิตแบบเด็ก ตจว. กินงู กินหมูป่า กินนก ผมกินเป็นหมดละ
        บ้านที่ผมอยู่ ประปา ยังไม่มีเลย ต้อง ใช้น้ำบาดาล น้ำคลอง (บ้านใกล้ๆกันเป็นโรงงานน้ำดื่ม ต้องยกน้ำจากที่นั่นมากินที่บ้าน)ผมใช้ชีวิตเป็นเด็กวัดด้วย ขี่จักรยาน ไปเอาข้าววัดมากิน
        ส่วนยายผมเขาจะส่งตังจากกรุงเทพ ไปให้ ผมใช้ เพราะญาติที่จัน บ้านย่า ก็ไม่ได้มีฐานะอะไรมาก
        ในช่วง 4 ปี ที่ผมอยู่บ้านย่า ตอนขึ้น ม.1 ผมย้ายไปเรียนโรงเรียน ประจำจังหวัด ผมสอบติด (ม.ต้น เป็นโรงเรียนชายล้วน)
        ผมต้อง นั่งรถ 2 แถว เข้าเมืองมาเรียน ในตัวเมือง ตอนเย็น ก็นั่ง 2 แถวกลับ
        ตอน ขึ้น ม.2 เพื่อนๆ ผมเขาเรียนพิเศษหลังเลิกเรียนกัน แต่ผมไม่มีตังเรียน เคยขอลุงแล้ว ลุงก็ไม่มีให้
        แต่ตอนนั้น ผมเข้าใจทางบ้าน และมองโลกในแง่ดี ว่า ผมอ่านเองก็ได้ ผมกลับมาบ้านก็นั่งแก้สมการ วันนึงเยอะมาก
        ผลปรากฏว่า ตอน ม.2 ผมได้คะแนน คณิตศาสตร์เพิ่มเติม Top แซงเด็กที่เรียนพิเศษทั้งหมด ฮ่าๆ
        ด้วยความที่เรียนโรงเรียนในตัวเมือง เพื่อนๆก็จะมี มือถือใช้ ผมน่าจะเป็นเด็กไม่กี่คนในห้อง ที่ไม่มีมือถือใช้  แต่บ้านย่าผมมีโทรศัพท์บ้าน ผมคุยกับยาย จากตรงนั้น
        พอ จบ ม.3 ผมย้ายกลับมาอยู่บ้านยาย ที่ กรุงเทพอีกครั้ง เพื่อเรียนต่อ ม.4
        วันสุดท้าย ที่ผมอยู่ที่จันทบุรี ผมจากมา โดยไม่ได้ลาญาติที่จันทบุรีสักคน แต่โทรบอกยายล่วงหน้าละว่าจะไปกรุงเทพ
        ตอนนั้นผมทำใจไม่ได้ที่ต้องลา ผมเอาหนังสือเรียน ตั้งแต่ ม.1-ม.3 ติดกระเป่าเสื้อผ้ามาด้วย เสื้อผ้ายังน้อยกว่า หนังสือเรียนอีก
        นี่คือ ชีวิต ช่วง ป.6 - ม.3 ตลอด 4 ปี ที่ผมได้ย้าย ไปอยู่กับญาติฝั่งพ่อ ที่ จันทบุรี (มีความทรงจำดีดี ที่นั่นอีกมาก ที่ผมผูกผัน เยอะเลย)
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>

    <article className="px-4">
      <p className="text-2xl"># 3. ความทรงจำ ม.4 - ป.ตรี</p>
      <p className="indent-6 text-sm">
        พอขึ้น ม.4 ผมก็ได้ย้ายมาเรียนที่กรุงเทพฯ บ้านที่ผมอยู่ มี ตา ยาย และก็ ป้าเล็ก ป้าอ้วน
        ส่วนแม่ผม เขามีแฟนใหม่ มีครอบครัว ใหม่ มีลูกใหม่ไปแล้ว 3 คน อยู่บ้านแฟนใหม่เขา ที่ไม่ไกลจากบ้านยายนัก
        ผมเริ่มเข้าโรงเรียนไตรมิตร ช่วง ม.4 (โรงเรียนชายล้วน) ผมตั้งใจเรียนมากๆ ไม่เอาเพื่อนเลย เพราะผมเป็น เด็ก ตจว. มาเรียน กรุงเทพ
        ช่วง ม.4 คนที่บ้านเขาชอบบ่นผมว่า วันหยุด ไม่ยอมไปไหน เอาแต่อยู่บ้านอ่านหนังสือ ตอนนั้น ผมขยันมาก ทำงานบ้านทุกวันหยุด กวาดบ้าน ถูบ้าน ล้างห้องน้ำ
        ไม่เกเร ปรากฏว่าผมได้ที่ 1 ศิลป์-คำนวณ
        พอขึ้น ม.5 - ม.6 ผมก็เริ่ม ลดการเรียนลง และเริ่มติดเพื่อน เลิกเรียนก็ไปเตะบอล การเรียนดิ่งลงเหวมากๆ ตามประสาวัยรุ่นหนุ่มคนนึง
        จนช่วงใกล้ จบ ม.6 ผมเริ่มกลับมาตั้งใจเรียน อ่านหนังสือ เพื่อ Admission ผมติด มศว. แต่ว่าข้าเทอมแพงมาก ยายผมเขาบอกว่าจ่ายค่าเทอมไม่ไหว
        และในช่วงหาที่เรียนต่อผมก็ได้ไปสอบ ได้ทุน 98% ของ PIM ด้วยอีก 1 ที่เลยเลือกที่นั่น เพราะค่าเทอมไม่แพงถ้าหักทุนที่ได้แล้ว
        ผมเข้าเรียนใน สาขา IT ผมชอบเขียน Code เขียน โปรแกรม ชีวิตช่วงมหาลัย เป็นช่วง ปากกัดตีนถีบ ถูๆไถ มากๆ
        ช่วง ปี1-ปี2 ผมทะเลาะกับคนที่บ้านเรื่องจุกจิกบ่อยๆ
        ป้าเล็ก เขาพูดว่า ผมจะไปเรียนทำไม เรียนไปก็ไม่จบหรอก (เขาจิตไม่ปกติ)
        ส่วนยายผม เขาก็ใกล้จะเกษียณแล้ว เขาส่งผม เท่าที่เขาไหว
        จนขึ้น ปี 3 ผมฝึกงานได้เงิน ผมเลยตัดสินใจ บอกยายผมไปว่า ไม่ต้องให้เงินผมแล้ว
        ชีวิตผมอยู่รอดช่วง ปี3-ปี4 ด้วยเงินฝึกงาน กับ เงินที่ได้จากอาจารย์ที่ปรึกษาทำโปรเจคให้อาจารย์
        (ตอนนั้นยายผมเขาเกษียณ จาก บริษัท ปุ๋ย พอดี และตัวเขาได้ย้ายไปอยู่บ้านเขาอีกหลังที่พุทธมณฑลสาย 5 ส่วนผมยังอยู่ ที่บ้านยายต่อ)
        แน่นอน ว่า ในช่วงฝึกงานที่ทรู รัชดา 9 เดือน ผมมีช่วงที่ เงินขาดมือ เพราะเงินที่ได้จากการฝึกงานได้ช้า
        ผมแก้ปัญหาด้วยการ ออกจากบ้าน ตอน ตี 3 เพื่อไปฝึกงานรัชดา (ไม่มีค่ารถ ไม่มีเงินสักบาท)
        มีน้ำเปล่าแค่ 1 ขวด (แค่นั้นเลย) พอพักเที่ยง ผมต้องหาที่หลบ เพราะไม่มีเงินกินข้าว พอตอนเย็น ผมเดินจากรัชดา กลับบ้าน อีกหลายกิโล - เดินตามทางรถเมล์ รถไฟฟ้า มือถือผมตอนนั้น คือ Samsung Hero  นี่เป็นความลับในชีวิตที่ผมไม่เคยบอกใครเลย
        วันไหน ที่ ต้องเข้ามหาลัย ถ้าผมช๊อต ผมจะเดินจากบ้าน ไปอนุเสาวรีย์ เพราะไม่มีแม้กระทั่งค่ารถ นั่งจากบ้านไปอนุเสาวรีย์
        ผมฝึกงานที่ทรู 9 เดือน ผ่านมาได้ ชีวิต ทรหด สุดๆ
        เวลาที่ผมไปเยี่ยมยาย ที่สาย 5 ยายจะพาผมไปห้าง นี่คือ หรูสุดละ ที่เคยไปเที่ยวกับยาย
        ผมไม่เคยขออะไรจากยายผมเลย ขนมสักซอง เสื้อสักตัว หน้าที่ผมคือ ไปช่วยเขายกของ ผมคิดแค่นั้น และไม่อยากเป็นภาระเขา
        ยายผมเขาก็ถามผมเสมอแหล่ะ ว่าอยากได้ อยากซื้ออะไรไหม เวลาไปห้างด้วยกัน ผมโตมาโดยที่ไม่เคยขอหรือเรียกร้องอะไรจากคนรอบตัว ถ้าไม่จำเป็นจริงๆ ตั้งแต่ ประถม
        เวลาผ่านไป ผมก็เรียนจบ 4 ปี มาได้ ได้วุฒิ ป.ตรี ได้เกียรตินิยม อันดับ 1 ด้วย
        ตอนงานรับปริญญา ยายผมเขาบอกว่า ขาแข้ง ไม่ดี มางานผมไม่ได้ ผมเลย ต้องเอาแม่ ที่ไม่ได้ส่งเสีย อะไรผมเลย มาแทน
        เพราะ ถ้าไม่เอาแม่มา ผมก็ไม่มีผู้ปกครอง มาแบบเพื่อนคนอื่น
        นี่คือ ชีวิตของผม ตั้งแต่ ม.4 จนถึง จบ ป.ตรี
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article>

    {/* <article className="px-4">
      <p className="text-2xl"># 4.</p>
      <p className="indent-6">
        
      </p>
      <hr style={{ 'borderTop': '3px solid var(--color)' }} class="w-80 mx-auto my-4" />
      <br />
    </article> */}

    <br />< br /><br />< br />
  </div>
}
